
import banking.*;

public class TestBanking {

  public static void main(String[] args) {
    Bank  bank;
    Customer customer;
    Account account;

   
    // 1.创建银行
    
	// 2.该银行给张三开户，并创建他的储蓄账户，初始余额500元，利率3%
   
     
	// 3.该银行给李四开户，并创建他的信用账户，初始余额500元，但没有信用额度
       
   
	// 4.该银行给王五开户，并创建他的信用账户，初始余额500元，信用额度500元
    
    // 5.给王红开户，王红和他老公王五共享一个账户
            
	// 6.对张三账户进行操作 ：取款150元，存款22元，取款50元，存款400元，最后查看账户余额
	
    // 7.对李四的账户进行操作：取款150元，存款22元，取款50元，取款400元(查看取款是否成功)，最后查看账户余额
   
    // 8.对王五的账户进行操作：取款150元，存款22元，取款50元，取款400元(查看取款是否成功)，最后查看账户余额,查看信用账户余额

	// 9.对王红的账户进行操作：存款150元，取款750元(如果取款550呢？)，最后查看账户余额,查看信用账户余额
      

  }
}
